---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InaccuracyDetected
source: html/ee97620d-c724-748e-b15a-544a20f154ec.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InaccuracyDetected Property

A geometric inaccuracy was found in the element.

## Syntax (C#)
```csharp
public static FailureDefinitionId InaccuracyDetected { get; }
```